#+title: Paradox Wikis


#+BEGIN_SRC python :session paradox_wikis.org  :exports both
import pandas as pd
import json
import tabulate

from wikicrawl.mediawiki_utils import parse_wiki_dump
import mwxml
# with open("eu4_depth2.json") as f:
#     eu4_records = json.load(f)

# eu4_df = pd.DataFrame.from_records(eu4_records)
#+END_SRC

#+RESULTS:
: None

** Parsing with mwxml

=mwxml= (https://github.com/mediawiki-utilities/python-mwxml) is a library for parsing MediaWiki XML dumps with memory-efficient streaming. Install with =uv add mwxml=.

#+BEGIN_SRC python :session paradox_wikis.org :exports both


def show_first_dump_page(xml_path):
    """Parse MediaWiki XML dump to DataFrame with latest revision per page."""
    records = []
    dump = mwxml.Dump.from_file(open(xml_path, 'rb'))

    return next(dump)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
xml_path = "eu5.paradoxwikis.com-20251210-wikidump/eu5.paradoxwikis.com-20251210-history.xml"
eu5_df = parse_wiki_dump(xml_path)
eu5_df.columns
#+END_SRC

#+RESULTS:
: Index(['page_id', 'title', 'namespace', 'redirect', 'rev_id', 'timestamp',
:        'contributor', 'comment', 'text', 'text_length'],
:       dtype='object')

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
first_page = show_first_dump_page(xml_path)
for rev in first_page:
    pass
rev
#+END_SRC

#+RESULTS:
: Revision(id=14126, timestamp=Timestamp('2025-11-04T19:25:52Z'), user=User(id=4667, text='CaesarVincens'), page=Page(id=1, title='Main Page', namespace=0, redirect='Europa Universalis 5 Wiki', restrictions=[]), minor=True, comment='Changed redirect target from [[Tomato Wiki]] to [[Europa Universalis 5 Wiki]]', slots=Slots(sha1='bn8avj5j8ws2qf5u56160dxfa5k3v9f', contents={'main': Content(role='main', origin=None, model='wikitext', format='text/x-wiki', deleted=False, location=None, bytes=39, sha1='bn8avj5j8ws2qf5u56160dxfa5k3v9f', text='#REDIRECT [[Europa Universalis 5 Wiki]]')}), parent_id=222, deleted=Deleted(text=False, comment=False, user=False, restricted=None))

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
eu5_df.to_csv("eu5_mediawiki.csv")
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
eu5_df.describe()
#+END_SRC

#+RESULTS:
:             page_id     namespace        rev_id   text_length
: count  11286.000000  11286.000000  11286.000000  1.128600e+04
: mean    5713.755449     12.264841  11637.194489  1.494668e+03
: std     3276.945995     72.772133   5789.021523  2.479656e+04
: min        1.000000      0.000000      3.000000  0.000000e+00
: 25%     2877.250000      6.000000   7605.000000  6.700000e+01
: 50%     5723.500000      6.000000  12399.500000  7.200000e+01
: 75%     8547.750000      6.000000  16502.750000  1.920000e+02
: max    11387.000000    828.000000  20885.000000  1.638946e+06

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
#tabulate.tabulate(
eu5_df[eu5_df["title"] == "Age"]
#)
#+END_SRC

#+RESULTS:
:     page_id title  ...                                               text text_length
: 17      790   Age  ...  {{Version|pre-release}}{{Agenav}}\n'''Ages''' ...       35895
:
: [1 rows x 10 columns]

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
tabulate.tabulate(eu5_df.head())
#+END_SRC

#+RESULTS:
#+begin_example
-  -----  ---------------------------  -  -------------------------  -----  -----------  -------------  -----------------------------------------------------------------------------  --------------------------------------------------------------------------------------------  ---
0      1  Main Page                    0  Europa Universalis 5 Wiki  14126  1.76228e+09  CaesarVincens  Changed redirect target from [[Tomato Wiki]] to [[Europa Universalis 5 Wiki]]  #REDIRECT [[Europa Universalis 5 Wiki]]                                                        39
1  10470  ?=                           0  Scope                      18326  1.76323e+09  CaesarVincens  Redirected page to [[Scope#?=]]                                                #REDIRECT [[Scope#?=]]                                                                         22
2   6756  Ability                      0  Characters                 10015  1.76195e+09  Kami-sama      Redirected page to [[Characters#Abilities]]                                    #REDIRECT [[Characters#Abilities]]                                                             34
3  10360  Absolutism                   0                             15471  1.76268e+09  CaesarVincens  Change to disambiguation                                                       '''Absolutism''' can refer to                                                                 179
                                                                                                                                                                                       ,* {{iconify|Absolutism|societal value|link|link=Absolutism (societal value)}} societal value
                                                                                                                                                                                       ,* {{iconify|Age of Absolutism||link}}
                                                                                                                                                                                       {{Disambiguation}}
4  10380  Absolutism (disambiguation)  0  Absolutism                 15472  1.76268e+09  CaesarVincens  Redirected page to [[Absolutism]]                                              #REDIRECT [[Absolutism]]                                                                       24
-  -----  ---------------------------  -  -------------------------  -----  -----------  -------------  -----------------------------------------------------------------------------  --------------------------------------------------------------------------------------------  ---
#+end_example

Almost none pages are duplicated (main page is)

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
eu5_df["page_id"].value_counts()
#+END_SRC

#+RESULTS:
#+begin_example
page_id
1        2
8819     1
10549    1
1576     1
10500    1
        ..
5155     1
1300     1
1291     1
1253     1
11229    1
Name: count, Length: 11285, dtype: int64
#+end_example

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
eu5_df["title"].str.startswith("Game Concep")
#+END_SRC

#+RESULTS:
#+begin_example
0        False
1        False
2        False
3        False
4        False
         ...
11281    False
11282    False
11283    False
11284    False
11285    False
Name: title, Length: 11286, dtype: bool
#+end_example

** Link extraction
:PROPERTIES:
:CREATED:  <2025-12-11 Thu> [12:12]
:END:

#+BEGIN_SRC python :session paradox_wikis.org  :exports both
example_record = eu5_df[eu5_df["page_id"] == 1943].iloc[0]
example_record["text"][:250]
#+END_SRC

#+RESULTS:
: {{Version|pre-release}}
: [[File:UI economy.png|right|thumb|330px|The economy menu]]
: At the start of the game most countries start with {{Read define|NEconomy|DEFAULT_CURRENCY_STABILITY}} {{iconify|Stability}}, {{Read define|NEconomy|DEFAULT_CURRENCY_P

Links in MediaWiki are embedded in wikitext as =[[Target]]=, =[[Target|Display]]=, or =[[Target#Section]]=. They need to be extracted with regex or a parser.

#+BEGIN_SRC python :session paradox_wikis.org :exports both
from wikicrawl.mediawiki_utils import extract_links

# Test on example
extract_links(example_record["text"])
#+END_SRC

#+RESULTS:
| page | : | advances                   | section | : | None                     |
| page | : | RGO                        | section | : | None                     |
| page | : | Estates                    | section | : | None                     |
| page | : | Legislative_efficiency.png | section | : | None                     |
| page | : | Country                    | section | : | None                     |
| page | : | Army                       | section | : | None                     |
| page | : | Regiments                  | section | : | None                     |
| page | : | Army Levies                | section | : | None                     |
| page | : | Buildings                  | section | : | None                     |
| page | : | Advances                   | section | : | None                     |
| page | : | Country                    | section | : | None                     |
| page | : | Ships                      | section | : | None                     |
| page | : | Navy                       | section | : | None                     |
| page | : | Naval Levies               | section | : | None                     |
| page | : | Exploration                | section | : | None                     |
| page | : | Buildings                  | section | : | None                     |
| page | : | Advances                   | section | : | None                     |
| page | : | Goods                      | section | : | Raw_goods                |
| page | : | Weather                    | section | : | None                     |
| page | : | Winter                     | section | : | None                     |
| page | : | Development                | section | : | None                     |
| page | : | Topography                 | section | : | None                     |
| page | : | societal values            | section | : | None                     |
| page | : | Estate Satisfaction        | section | : | None                     |
| page | : | Laws                       | section | : | None                     |
| page | : | Advances                   | section | : | None                     |
| page | : | Common_buildings           | section | : | Infrastructure_Buildings |
